Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Rather than enumerating here how each tool makes use of these common mechanisms, textboxes like this will make note of the specific usages in each tool as they come up in the course of the text.
it_it: Anziché elencare qui come ogni tool utilizza questi meccanismi comuni, riquadri di testo come questo indicheranno gli usi specifici in ogni strumento man mano che vengono menzionati nel corso del testo.

source: Rather than starting a local server, another possibility is to rely on a Hash Equivalence server on a network, by setting::
it_it: In alternativa all'avvio di un server locale, è possibile utilizzare un server di equivalenza hash in rete, impostando:

source: Real-World Examples
it_it: Esempi Pratici

source: Realize that there can be patches merged onto the stable release branches as and when they become available.
it_it: È importante notare che le patch possono essere integrate nei rami della versione stabile non appena disponibili.

source: Recipe License Fields
it_it: Campi di Licenza della Ricetta

source: Recipe Naming Conventions
it_it: Convenzioni di Nomenclatura delle Ricette

source: Recipe Ordering
it_it: Ordinamento delle Ricette

source: Recipe Style Guide
it_it: Guida di Stile per le Ricette

source: Recipe formatting
it_it: Formattazione delle Ricette

source: Recipe metadata
it_it: Metadati della ricetta

source: Recipe versions should always compare and sort correctly so that upgrades work as expected. With conventional versions such as ``1.4`` upgrading to ``1.5`` this happens naturally, but some versions don't sort. For example, ``1.5 Release Candidate 2`` could be written as ``1.5rc2`` but this sorts after ``1.5``, so upgrades from feeds won't happen correctly.
it_it: Le versioni delle ricette dovrebbero sempre essere confrontate e ordinate correttamente in modo che gli aggiornamenti funzionino come previsto. Con le versioni convenzionali come ``1.4`` che vengono aggiornate a ``1.5``, questo avviene naturalmente, ma alcune versioni non vengono ordinate correttamente. Ad esempio, ``1.5 Release Candidate 2`` potrebbe essere scritto come ``1.5rc2`` ma questo ordine viene eseguito dopo ``1.5``, quindi gli aggiornamenti dai feed non avverranno correttamente.

source: Recipes
it_it: Ricette

source: Recipes need to define both the :term:`LICENSE` and :term:`LIC_FILES_CHKSUM` variables:
it_it: Le ricette devono definire entrambe le variabili :term:`LICENSE` e :term:`LIC_FILES_CHKSUM`:

source: Recipes should have tasks which are idempotent, i.e. that executing a given task multiple times shouldn't change the end result. The build environment is built upon this assumption and breaking it can cause obscure build failures.
it_it: Le ricette dovrebbero contenere task idempotenti, ovvero l'esecuzione ripetuta di un determinato task non dovrebbe modificare il risultato finale. L'ambiente di compilazione si basa su questo presupposto e la sua violazione può causare errori di compilazione difficili da individuare.

source: Recipes that are not reproducible may have undesired behavior if hash equivalence is enabled, since the non-reproducible diverging output maybe be remapped to an older sstate object in the cache by the server. If a recipe is non-reproducible in trivial ways, such as different timestamps, this is likely not a problem. However recipes that have more dramatic changes (such as completely different file names) will likely outright fail since the downstream sstate objects are not actually equivalent to what was just built.
it_it: Le ricette non riproducibili potrebbero presentare comportamenti indesiderati se l'hash equivalence è abilitata, poiché l'output divergente non riproducibile potrebbe essere rimappato dal server a un oggetto sstate precedente nella cache. Se una ricetta non è riproducibile per motivi banali, come timestamp diversi, questo probabilmente non rappresenta un problema. Tuttavia, le ricette che presentano modifiche più drastiche (come nomi di file completamente diversi) probabilmente falliranno del tutto, poiché gli oggetti sstate a valle non sono effettivamente equivalenti a quelli appena creati.

source: Reference Embedded Distribution (Poky)
it_it: Distribuzione Embedded di Riferimento (Poky)

source: Reference Manual
it_it: Manuale di Riferimento

source: Regardless of the type of SDK being constructed, the tasks perform some cleanup after which a cross-development environment setup script and any needed configuration files are created. The final output is the Cross-development toolchain installation script (``.sh`` file), which includes the environment setup script.
it_it: Indipendentemente dal tipo di SDK in fase di creazione, i task eseguono alcune operazioni di pulizia, dopodiché vengono creati uno script di configurazione dell'ambiente di cross-sviluppo e tutti i file di configurazione necessari. L'output finale è lo script di installazione della toolchain di cross-sviluppo (file ``.sh``), che include lo script di configurazione dell'ambiente [environment].

source: Regular mirrors can be any site across the Internet that is used as an alternative location for source code should the primary site not be functioning for some reason or another.
it_it: I mirror standard possono essere qualsiasi sito su Internet utilizzato come posizione alternativa per il codice sorgente nel caso in cui il sito principale non sia funzionante per un motivo o per l'altro.

source: Regularly scan and apply fixes for CVE security issues affecting all software components in the product, see ":ref:`security-manual/vulnerabilities:checking for vulnerabilities`".
it_it: Eseguire regolarmente scansioni e applicare le correzioni per le vulnerabilità di sicurezza CVE che interessano tutti i componenti software del prodotto. Vedere ":ref:`security-manual/vulnerabilities:checking for vulnerabilities`".

source: Regularly update your version of :term:`BitBake` and your layers (e.g. :term:`OpenEmbedded-Core (OE-Core)`, :yocto_git:`meta-yocto </meta-yocto/>`, ...), e.g. to apply updates and security fixes from stable and :term:`LTS` branches.
it_it: Aggiornare regolarmente la versione di :term:`BitBake` e dei layer (ad esempio :term:`OpenEmbedded-Core (OE-Core)`, :yocto_git:`meta-yocto </meta-yocto/>`, ...), ad esempio per applicare aggiornamenti e correzioni di sicurezza dai branch stable e :term:`LTS`.

source: Release Information
it_it: Informazioni sulla Release

source: Release Manuals
it_it: Manuali delle Release

source: Release Notes and Migration Guides
it_it: Note di Rilascio e Guide alla Migrazione

source: Release notes and migration guides for the different Yocto Project releases.
it_it: Note di rilascio e guide alla migrazione per le diverse versioni di Yocto Project.

source: Released BSP Recommendations
it_it: Raccomandazioni per i BSP Rilasciati

source: Released BSP Requirements
it_it: Requisiti per i BSP Rilasciati

source: Releases
it_it: Release

source: Releases are given a nominal release version as well but the codename is used in repositories for this reason. You can find information on Yocto Project releases and codenames in the :yocto_home:`Releases page </development/releases/>`.
it_it: Anche alle release viene assegnata una versione nominale, ma il nome in codice viene utilizzato nei repository per questo scopo. Informazioni sulle release e sui nomi in codice di Yocto Project si trovano nella pagina :yocto_home:`pagina dei rilasci </development/releases/>`.

source: Remote Toaster Monitoring
it_it: Monitoraggio Remoto di Toaster

source: Remove any software from the image that is not needed.
it_it: Rimuovere dall'immagine qualsiasi software non necessario.

source: Remove it with the following command::
it_it: Rimuoverla con il seguente comando::

source: Remove the temporary outputs again:
it_it: Rimuovere nuovamente gli output temporanei:

source: Reporting Vulnerabilities
it_it: Segnalazione di Vulnerabilità

source: Reporting a Defect Against the Yocto Project and OpenEmbedded
it_it: Segnalazione di un Difetto in Yocto Project e in OpenEmbedded

source: Repositories, Tags, and Branches
it_it: Repository, Tag e Branch

source: Required Git, tar, Python, make and gcc Versions
it_it: Versioni richieste di Git, tar, Python, make e gcc

source: Required Packages for the Build Host
it_it: Pacchetti Richiesti per l'Host di Build

source: Required Variables
it_it: Variabili Obbligatorie

source: Requirements
it_it: Requisiti

source: Requirements and Recommendations for Released BSPs
it_it: Requisiti e Raccomandazioni per i BSP Rilasciati

source: Richard Purdie: <richard.purdie [at] linuxfoundation [dot] org> `Public key <https://keys.openpgp.org/search?q=richard.purdie%40linuxfoundation.org>`__
it_it: Richard Purdie: <richard.purdie [at] linuxfoundation [dot] org> `Chiave pubblica <https://keys.openpgp.org/search?q=richard.purdie%40linuxfoundation.org>`__

source: RockyLinux Packages
it_it: Pacchetti RockyLinux

source: Ross Burton: <ross [at] burtonini [dot] com> `Public key <https://keys.openpgp.org/search?q=ross%40burtonini.com>`__
it_it: Ross Burton: <ross [at] burtonini [dot] com> `Chiave pubblica <https://keys.openpgp.org/search?q=ross%40burtonini.com>`__

source: Run the BitBake command to build the tarball::
it_it: Eseguire il comando BitBake per creare il tarball::

source: Run the ``create_recipe_spdx`` task for ``gettext-minimal-native``, but this time pass the new ``sstate-sig-key.conf`` file to :term:`BitBake`:
it_it: Eseguiamo il task ``create_recipe_spdx`` per ``gettext-minimal-native``, ma questa volta passiamo il nuovo file ``sstate-sig-key.conf`` a :term:`BitBake`:

source: Run the instrumented "hello world" program::
it_it: Eseguire il programma "hello world" strumentato [instrumented]::

source: Run the service::
it_it: Avviare il servizio::

source: Running a Script on a Target
it_it: Esecuzione di uno Script su un Target

source: Running this script forms ``*.patch`` files in a folder named ``pull-``\ `PID` in the current directory. One of the patch files is a cover letter.
it_it: L'esecuzione di questo script crea file ``*.patch`` in una cartella denominata ``pull-``\ `PID` nella directory corrente. Uno dei file patch è una lettera di presentazione.

source: Runs a supported Linux distribution (i.e. recent releases of Fedora, openSUSE, CentOS, Debian, or Ubuntu). For a list of Linux distributions that support the Yocto Project, see the :ref:`ref-manual/system-requirements:supported linux distributions` section in the Yocto Project Reference Manual. For detailed information on preparing your build host, see the :ref:`dev-manual/start:preparing the build host` section in the Yocto Project Development Tasks Manual.
it_it: Deve eseguire una distribuzione Linux supportata (ad esempio, versioni recenti di Fedora, openSUSE, CentOS, Debian o Ubuntu). Per un elenco delle distribuzioni Linux che supportano lo Yocto Project, consultare la sezione :ref:`ref-manual/system-requirements:supported linux distributions` nel Manuale di Riferimento di Yocto Project. Per informazioni dettagliate sulla preparazione dell'host di compilazione, consultare la sezione :ref:`dev-manual/start:preparing the build host` nel Manuale di Sviluppo dei Task di Yocto Project.

source: SDK Generation
it_it: Generazione dell'SDK

source: Scan additional code you are adding to the system (e.g. application code) by using static analysis tools. Look for buffer overflows and other potential security problems.
it_it: Analizzare [scan] il codice aggiuntivo che si sta inserendo nel sistema (ad esempio, il codice dell'applicazione) utilizzando strumenti di analisi statica. Cercare buffer overflow e altri potenziali problemi di sicurezza.

source: Secondary Supported
it_it: Supporto Secondario

source: Security Flags
it_it: Flag di Sicurezza

source: Security Manual
it_it: Manuale di Sicurezza

source: Security Reference
it_it: Riferimento sulla Sicurezza

source: Security Team Members
it_it: Membri del Team di Sicurezza

source: Security Team Operations
it_it: Operazioni del Security Team

source: Security and CVE fixes
it_it: Correzioni di sicurezza e CVE

source: Security is a process, not a product, and thus at any time, a number of security issues may be impacting :term:`OpenEmbedded-Core (OE-Core)`. It is up to the maintainers, users, contributors and anyone interested in the issues to investigate and possibly fix them by updating software components to newer versions or by applying patches to address them. It is recommended to work with :term:`OpenEmbedded-Core (OE-Core)` upstream maintainers and submit patches to fix them, see ":doc:`/contributor-guide/submit-changes`" for details.
it_it: La sicurezza è un processo, non un prodotto, e pertanto, in qualsiasi momento, diversi problemi di sicurezza potrebbero interessare :term:`OpenEmbedded-Core (OE-Core)`. Spetta ai manutentori, agli utenti, ai collaboratori e a chiunque sia interessato ai problemi indagare e, se possibile, risolverli aggiornando i componenti software a versioni più recenti o applicando patch per correggerli. Si consiglia di collaborare con i manutentori di :term:`OpenEmbedded-Core (OE-Core)` e di inviare patch per risolverli; per maggiori dettagli, consultare ":doc:`/contributor-guide/submit-changes`".

source: Security team
it_it: Team di sicurezza

source: Security team appointment
it_it: Nomina del team di sicurezza

source: Security-related discussions at the Yocto Project
it_it: Discussioni relative alla sicurezza in Yocto Project

source: Security-related processes and contact information for vulnerability reporting.
it_it: Procedure relative alla sicurezza e informazioni di contatto per la segnalazione di vulnerabilità.

source: See :doc:`bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup` for more information.
it_it: Per ulteriori informazioni, consultare la documentazione :doc:`bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup`.

source: See :ref:`security-manual/vulnerabilities:checking for vulnerabilities` for details about CVE tracking.
it_it: Consultare :ref:`security-manual/vulnerabilities:checking for vulnerabilities` per i dettagli sul tracciamento delle CVE.

source: See :yocto_wiki:`/Stable_Release_and_LTS` for details about the management of stable and :term:`LTS` releases.
it_it: Consultare :yocto_wiki:`/Stable_Release_and_LTS` per i dettagli sulla gestione delle versioni stabili e :term:`LTS`.

source: See `more guidance about using such tags <https://www.kernel.org/doc/html/latest/process/submitting-patches.html#using-reported-by-tested-by-reviewed-by-suggested-by-and-fixes>`__ in the Linux kernel documentation.
it_it: Per, `ulteriori informazioni sull'utilizzo di questi tag <https://www.kernel.org/doc/html/latest/process/submitting-patches.html#using-reported-by-tested-by-reviewed-by-suggested-by-and-fixes>`__ consultare la documentazione del kernel Linux.

source: See `this tutorial <https://hackernoon.com/beginners-guide-to-interactive-rebasing-346a3f9c3a6d>`__ for practical guidance about using Git interactive rebasing.
it_it: Consultare questo tutorial `this tutorial <https://hackernoon.com/beginners-guide-to-interactive-rebasing-346a3f9c3a6d>`__ per una guida pratica sull'utilizzo del rebase interattivo di Git.

source: See all the unvarnished details of how this bug was diagnosed and solved here: Yocto Bug #3049
it_it: Per tutti i dettagli su come questo bug è stato diagnosticato e risolto, consultare: Yocto Bug #3049

source: See also `KernelShark's documentation <https://kernelshark.org/Documentation.html>`__ for further usage details.
it_it: Consultare anche la documentazione di `KernelShark' <https://kernelshark.org/Documentation.html>`__ per ulteriori dettagli sull'utilizzo.

source: See dependency relationships between recipes, packages and tasks.
it_it: Visualizzare le relazioni di dipendenza tra ricette, pacchetti e task.

source: See dependency relationships between recipes, packages, and tasks.
it_it: Visualizzare le relazioni di dipendenza tra ricette, pacchetti e task.

source: See information about the BitBake tasks executed and reused during your build, including those that used shared state.
it_it: Visualizzare informazioni sui task di BitBake eseguiti e riutilizzati durante la build, incluse quelli che hanno utilizzato lo "shared state".

source: See performance information such as build time, task time, CPU usage, and disk I/O.
it_it: Visualizzare informazioni sulle prestazioni, come tempo di compilazione, tempo di esecuzione dei task, utilizzo della CPU e I/O del disco.

source: See the ":ref:`The Build Directory --- build/ <structure-build>`" section for details about the contents of the :term:`Build Directory`.
it_it: Consultare la sezione ":ref:`The Build Directory --- build/ <structure-build>`" per dettagli sul contenuto della :term:`Build Directory`.

source: See the ":ref:`system-requirements-buildtools`" paragraph in the Reference Manual for details about downloading or building an archive of such tools.
it_it: Consultare il paragrafo ":ref:`system-requirements-buildtools`" nel Manuale di Riferimento per i dettagli sul download o la creazione di un archivio di tali strumenti.

source: See the "Examine Your Current Configuration" step earlier for more information on configuring the build.
it_it: Per ulteriori informazioni sulla configurazione della compilazione, consultare il passaggio "Esaminare la Configurazione Corrente" precedente.

source: See the :doc:`bitbake:bitbake-user-manual/bitbake-user-manual-fetching` section of the BitBake User Manual for more information.
it_it: Per ulteriori informazioni, consultare la sezione :doc:`bitbake:bitbake-user-manual/bitbake-user-manual-fetching` del Manuale Utente di BitBake.

source: See the :ref:`Release process <ref-manual/release-process:Stable Release Process>` documentation for details regarding the policies and maintenance of stable branches.
it_it: Consultare la documentazione :ref:`Processo di rilascio <ref-manual/release-process:Stable Release Process>` per i dettagli relativi alle politiche e alla manutenzione dei branch stabili.

source: See the :ref:`dev-manual/start:setting up to use windows subsystem for linux (wsl 2)` section in the Yocto Project Development Tasks Manual for more information.
it_it: Per ulteriori informazioni, consultare la sezione :ref:`dev-manual/start:setting up to use windows subsystem for linux (wsl 2)` nel Manuale di Sviluppo dei Task di Yocto Project.

source: See the :ref:`kernel-dev/common:Changing the Configuration` section of the Yocto Project Linux Kernel Development Manual for more information.
it_it: Per ulteriori informazioni, consultare la sezione :ref:`kernel-dev/common:Changing the Configuration` del Manuale di Sviluppo del Kernel Linux di Yocto Project.

source: See the :ref:`system-requirements-supported-distros` section of the Yocto Project Reference Manual for more information on supported host distributions.
it_it: Per ulteriori informazioni sulle distribuzioni host supportate, consultare la sezione :ref:`system-requirements-supported-distros` del Manuale di Riferimento di Yocto Project.

source: See the :term:`SYSROOT_* <SYSROOT_DESTDIR>` variables controlling how sysroots are created and stored.
it_it: Vedere le variabili :term:`SYSROOT_* <SYSROOT_DESTDIR>` che controllano la creazione e la memorizzazione dei sysroot.

source: See the :wikipedia:`Software Supply Chain <Software_supply_chain>` article on Wikipedia for more details.
it_it: Per maggiori dettagli, consultare l'articolo :wikipedia:`Software Supply Chain <Software_supply_chain>` su Wikipedia.

source: See the `git format-patch manual page <https://git-scm.com/docs/git-format-patch>`__ for details.
it_it: Consultare la `pagina del manuale di git <https://git-scm.com/docs/git-format-patch>`__ per maggiori dettagli.

source: See the `git send-email manual page <https://git-scm.com/docs/git-send-email>`__ for details.
it_it: Consultare la `pagina del manuale di send-email di git <https://git-scm.com/docs/git-send-email>`__ per maggiori dettagli.

source: See the `video <https://www.youtube.com/watch?v=zXEdqGS62Wc>`__ of Joshua Watt's `Hash Equivalence and Reproducible Builds <https://elinux.org/images/3/37/Hash_Equivalence_and_Reproducible_Builds.pdf>`__ presentation at ELC 2020 for a very synthetic introduction to the Hash Equivalence implementation in the Yocto Project.
it_it: Guardare il `video <https://www.youtube.com/watch?v=zXEdqGS62Wc>`__ della presentazione di Joshua Watt su `Hash Equivalence and Reproducible Builds <https://elinux.org/images/3/37/Hash_Equivalence_and_Reproducible_Builds.pdf>`__ all'ELC 2020 per un'introduzione molto sintetica all'implementazione dell'equivalenza hash in Yocto Project.

source: See the value of all variables in your build configuration, and which files set each value.
it_it: Visualizzare il valore di tutte le variabili nella configurazione di build e quali file impostano ciascun valore.

source: See what was built (recipes and packages) and what packages were installed into your final image.
it_it: Visualizzare cosa è stato compilato (ricette e pacchetti) e quali pacchetti sono stati installati nell'immagine finale.

source: Select a target or multiple targets to build.
it_it: Selezionare uno o più target da compilare.

source: Selecting ``Annotate udhcpc_main``, we get a detailed listing of percentages by instruction for the ``udhcpc_main`` function. From the display, we can see that over 50% of the time spent in this function is taken up by a couple tests and the move of a constant (1) to a register:
it_it: Selezionando ``Annotate udhcpc_main``, otteniamo un elenco dettagliato delle percentuali per istruzione per la funzione ``udhcpc_main``. Dal display, possiamo vedere che oltre il 50% del tempo impiegato in questa funzione è occupato da un paio di test e dallo spostamento di una costante (1) in un registro:

source: Sending Patches via Email
it_it: Invio delle Patch via Email

source: Sending the Patches via Email
it_it: Invio delle Patch via Email

source: Set configuration variables.
it_it: Impostare le variabili di configurazione.

source: Set up Git
it_it: Configurazione di Git

source: Setscene Tasks and Shared State
it_it: I Task Setscene e Shared State

source: Setting :term:`UPSTREAM_STABLE_RELEASE_REGEX` for a recipe means that certain version upgrades can be confidently treated as stable point upgrades under OpenEmbedded's criteria. The :ref:`Automated Upgrade Helper (AUH) <dev-manual/upgrading-recipes:Using the Auto Upgrade Helper (AUH)>` will then automatically send patches to upgrade recipes with this variable set during stable releases.
it_it: Impostando :term:`UPSTREAM_STABLE_RELEASE_REGEX` per una ricetta, determinati aggiornamenti di versione possono essere considerati con sicurezza come aggiornamenti stabili secondo i criteri di OpenEmbedded. L':ref:`Automated Upgrade Helper (AUH) <dev-manual/upgrading-recipes:Using the Auto Upgrade Helper (AUH)>` invierà automaticamente le patch per aggiornare le ricette con questa variabile impostata durante le release stabili.

source: Setting Up Toaster Without a Build Server
it_it: Configurazione di Toaster Senza un Server di Build

source: Setting Up Toaster Without a Web Server
it_it: Configurazione di Toaster Senza un Server Web

source: Setting Up a Production Instance of Toaster
it_it: Configurazione di un'Istanza di Produzione di Toaster

source: Setting Up and Using Toaster
it_it: Configurazione e Utilizzo di Toaster

source: Setting Up and Using a Layer Source
it_it: Configurazione e Utilizzo di una Sorgente di Layer

source: Setting Up the Basic System Requirements
it_it: Impostazione dei Requisiti di Sistema di Base
